type_org_mapping = {
    'coffee': 'Кофейня',
    'coffee_to_go': 'Кофе с собой',
    'coffee_takeaway': 'Кофе на вынос',

    'sport': 'Спорт товары',
    'salon': 'Салоны красоты',
    'studio': 'Ателье',
    'auto': 'Автосалоны',
    'showroom': 'Шоу-рум одежды',
    'shop_female': 'Магазин женской одежды',
    'shop_male': 'Магазин мужской одежды',
    'shop_kids': 'Магазин детской одежды',
    'hotel': 'Отель',
    'psychology': 'Психологическая консультация',
    'lawyer': 'Юридические услуги',
    'dancing': 'Школа танцов',
    'barber': 'Парикмахерская',
    'massage': 'Массажный салон',
    'accountant': 'Бухгалтерские услуги',
    'translator': 'Бюро переводов',
    'cleaning': 'Клининговые услуги',
    'phones': 'Ремонт телефонов',
    'nails': 'Ногтевая студия',
    'build': 'Cтроительная компания',
    'flowers': 'Цветочный Магазин',
    'optics': 'Салон оптики',
    'candy': 'Кондитерская',
    'vish': 'Студия вышивки',
    'second': 'Секонд-хенд',
    'furniture': "мебель на заказ",
    'design': "дизайн интерьеров",
    'repair': "ремонт квартир",

    'RIP': "ритуальные услуги",
    'flowers_delivery': 'доставка цветов'
}

districts = [
    "Академический район", "Алексеевский район", "Бабушкинский район",
    "Басманный район",
    "Бескудниковский район", "Бутырский район",
    "Войковский район", "Гагаринский район", "Головинский район", "Даниловский район",
    "Донской район", "Красносельский район", "Мещанский район", "Можайский район",
    "Нагорный район",
    "Нижегородский район", "Обручевский район", "Останкинский район",
    "поселение Внуковское", "поселение Московский", "поселение Сосенское", "Пресненский район",
    "район Арбат", "район Аэропорт", "район Бибирево", "район Богородское", "район Братеево",
    "район Восточное Дегунино", "район Выхино-Жулебино", "район Гольяново",
    "район Дорогомилово", "район Замоскворечье", "район Зюзино",
    "район Зябликово", "район Измайлово", "район Коньково", "район Коптево",
    "район Косино-Ухтомский", "район Крылатское", "район Кузьминки", "район Кунцево",
    "район Левобережный", "район Лефортово", "район Люблино", "район Марфино",
    "район Марьина Роща", "район Марьино", "район Митино", "район Москворечье-Сабурово",
    "район Нагатино-Садовники", "район Нагатинский Затон", "район Некрасовка", "район Новогиреево",
    "район Новокосино", "район Ново-Переделкино", "район Орехово-Борисово Северное",
    "район Орехово-Борисово Южное", "район Отрадное", "район Очаково-Матвеевское",
    "район Перово", "район Печатники", "район Покровское-Стрешнево", "район Преображенское",
    "район Проспект Вернадского", "район Раменки", "район Ростокино", "район Свиблово",
    "район Северное Бутово", "район Северное Медведково", "район Северное Тушино",
    "район Сокол", "район Соколиная Гора", "район Сокольники", "район Солнцево", "район Строгино",
    "район Текстильщики", "район Тёплый Стан", "район Тропарёво-Никулино", "район Филёвский Парк",
    "район Фили-Давыдково", "район Хамовники", "район Ховрино", "район Хорошёво-Мнёвники", "район Царицыно",
    "район Черёмушки", "район Чертаново Северное", "район Чертаново Центральное", "район Чертаново Южное",
    "район Щукино", "район Южное Бутово", "район Южное Тушино", "район Якиманка", "район Ясенево",
    "Рязанский район", "Савёловский район", "Таганский район", "Тверской район", "Тимирязевский район",
    "Хорошёвский район", "Южнопортовый район"]

distr2 = [
    "Бескудниковский район", "Бутырский район",
    "Войковский район", "Гагаринский район", "Головинский район", "Даниловский район",
    "Донской район", "Красносельский район", "Мещанский район", "Можайский район",
    "Нагорный район",
    "Нижегородский район", "Обручевский район", "Останкинский район",
    "поселение Внуковское", "поселение Московский", "поселение Сосенское", "Пресненский район",
    "район Арбат", "район Аэропорт", "район Бибирево", "район Богородское", "район Братеево",
    "район Восточное Дегунино", "район Выхино-Жулебино", "район Гольяново",
    "район Дорогомилово", "район Замоскворечье", "район Зюзино",
    "район Зябликово", "район Измайлово", "район Коньково", "район Коптево",
    "район Косино-Ухтомский", "район Крылатское", "район Кузьминки", "район Кунцево",
    "район Левобережный", "район Лефортово", "район Люблино", "район Марфино",
    "район Марьина Роща", "район Марьино", "район Митино", "район Москворечье-Сабурово",
    "район Нагатино-Садовники", "район Нагатинский Затон", "район Некрасовка", "район Новогиреево",
    "район Новокосино", "район Ново-Переделкино", "район Орехово-Борисово Северное",
    "район Орехово-Борисово Южное", "район Отрадное", "район Очаково-Матвеевское",
    "район Перово", "район Печатники", "район Покровское-Стрешнево", "район Преображенское",
    "район Проспект Вернадского", "район Раменки", "район Ростокино", "район Свиблово",
    "район Северное Бутово", "район Северное Медведково", "район Северное Тушино",
    "район Сокол", "район Соколиная Гора", "район Сокольники", "район Солнцево", "район Строгино",
    "район Текстильщики", "район Тёплый Стан", "район Тропарёво-Никулино", "район Филёвский Парк",
    "район Фили-Давыдково", "район Хамовники", "район Ховрино", "район Хорошёво-Мнёвники", "район Царицыно",
    "район Черёмушки", "район Чертаново Северное", "район Чертаново Центральное", "район Чертаново Южное",
    "район Щукино", "район Южное Бутово", "район Южное Тушино", "район Якиманка", "район Ясенево",
    "Рязанский район", "Савёловский район", "Таганский район", "Тверской район", "Тимирязевский район",
    "Хорошёвский район", "Южнопортовый район"]

ACCEPT_BUTTON = '/ html / body / div[3] / div / div[1] / table / tbody / tr / td[2] / table / tbody / tr / td[2] / button'

# Agent
MY_HEADERS = {
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/123.0.0.0 '
                  'Safari/537.36',
    'Accept-Language': 'en-US,en;q=0.9',
    'Referer': 'https://www.google.com/'

}

# Список названий ссылок
LINK_NAMES = ['Контакты', 'О нас', 'О компании', 'Публичная оферта', 'Оферта', 'Реквизиты',
              'Политика конфидециальности', 'Политика в отношении обработки персональных данных',
              'Пользовательское соглашение', 'Политика конфиденциальности', 'Покупателям',
              'Политика конфиденциальности персональных данных', 'Наши реквизиты', 'Договор оферты',
              'Корп. клиентам', 'Корпоративным клиентам', 'Оплата', 'Реквизиты компании', 'Оплата и реквизиты',
              'О магазине'
              ]

STATIONS = [
    "Авиамоторная", "Академическая", "Александровский сад", "Алексеевская",
    "Алтуфьево", "Аннино", "Арбатская", "Автозаводская", "Алма-Атинская", "Аэропорт",
    "Бабушкинская", "Багратионовская", "Баррикадная", "Бауманская", "Беговая",
    "Белорусская", "Беляево", "Бибирево", "Библиотека Ленина", "Битцевский парк",
    "Борисово", "Боровицкая", "Ботанический сад", "Братиславская", "Бульвар Дмитрия Донского",
    "Бульвар Рокоссовского", "Бульвар адмирала Ушакова", "Бунинская Аллея", "Бутырская",
    "ВДНХ", "Варшавская", "Верхние Лихоборы", "Владыкино", "Волгоградский проспект",
    "Волжская", "Волоколамская", "Воробьевы горы", "Водный стадион", "Войковская",
    "Выставочная", "Выхино", "Деловой центр", "Дмитровская", "Добрынинская",
    "Достоевская", "Дубровка", "Динамо", "Домодедовская", "Жулебино",
    "Зябликово", "Измайловская", "Калужская", "Кантемировская", "Каховская",
    "Каширская", "Киевская", "Киевская", "Китай-город", "Кожуховская",
    "Комсомольская", "Коньково", "Котельники", "Коломенская", "Краснопресненская",
    "Красносельская", "Красные ворота", "Крестьянская застава", "Кропоткинская",
    "Красногвардейская", "Крылатское", "Кузнецкий мост", "Кузьминки", "Кунцевская",
    "Курская", "Кутузовская", "Ленинский проспект", "Лермонтовский проспект",
    "Лесопарковая", "Лубянка", "Люблино", "Марксистская", "Марьина роща",
    "Марьино", "Медведково", "Международная", "Менделеевская", "Митино",
    "Молодежная", "Мякинино", "Нагатинская", "Нагорная", "Нахимовский Проспект",
    "Новогиреево", "Новокосино", "Новокузнецкая", "Новослободская", "Новоясеневская",
    "Новые Черёмушки", "Окружная", "Октябрьская", "Октябрьское Поле", "Орехово",
    "Отрадное", "Охотный ряд", "Павелецкая", "Парк Культуры", "Парк Победы",
    "Партизанская", "Первомайская", "Перово", "Петровско-Разумовская", "Печатники",
    "Пионерская", "Планерная", "Площадь Ильича", "Площадь Революции", "Полежаевская",
    "Полянка", "Пражская", "Преображенская площадь", "Пролетарская", "Проспект Вернадского",
    "Проспект Мира", "Профсоюзная", "Пушкинская", "Пятницкое шоссе", "Речной вокзал",
    "Рижская", "Римская", "Румянцево", "Рязанский проспект", "Савеловская",
    "Саларьево", "Свиблово", "Севастопольская", "Семеновская", "Селигерская",
    "Серпуховская", "Славянский бульвар", "Смоленская", "Сокол", "Сокольники",
    "Спартак", "Спортивная", "Сретенский бульвар", "Строгино", "Студенческая",
    "Сухаревская", "Сходненская", "Таганская", "Текстильщики", "Теплый стан",
    "Тверская", "Театральная", "Тимирязевская", "Третьяковская", "Тропарёво",
    "Трубная", "Тульская", "Тургеневская", "Тушинская", "Улица 1905 года",
    "Улица Горчакова", "Улица Скобелевская", "Улица Старокачаловская", "Улица академика Янгеля",
    "Университет", "Филевский парк", "Фили", "Царицыно", "Фонвизинская",
    "Фрунзенская", "Цветной бульвар", "Черкизовская", "Чертановская", "Чеховская",
    "Чистые пруды", "Чкаловская", "Шаболовская", "Шипиловская", "Шоссе Энтузиастов",
    "Щелковская", "Щукинская", "Электрозаводская", "Юго-Западная", "Южная", "Ясенево"
]

SITE_PATTERNS = [
    "http://", "https://", "www.", ".com", ".ru", ".org", ".рф", ".art", ".moscow", ".studio", ".pro",
    ".tilda", ".site", ".company", ".su", ".ltd", ".info", ".москва", ".net", ".shop", ".online", ".store", ".online",
    ".flowers"
                 ]